Repository: AliakseiT/faiadashu
Catalog: lib/l10n/arb/fdash_*.arb
Languages: ar, ja

# validatorRequiredItem
source: This question needs to be completed.
ar: هذا السؤال يحتاج إلى أن يكتمل.
ja: この質問は完了する必要があります。

# validatorMinLength
source: {minLength, plural, =1 {Enter at least one character.} other {Enter at least {minLength} characters.}}
ar: {minLength, plural, =1 {أدخل على الأقل حرفًا واحدًا.} zero {} one {} two {} few {} many {} other {أدخل {minLength} حرفًا على الأقل.}}
ja: {minLength, plural, =1 {最低1文字入力してください} other {最低{minLength}文字入力してください。}}

# validatorMaxLength
source: {maxLength, plural, other{Enter up to {maxLength} characters.}}
ar: {maxLength, plural, other {أدخل حتى {maxLength} حرفًا.}}
ja: {maxLength, plural, other{最大{maxLength}文字まで入力できます。}}

# validatorUrl
source: Enter a valid URL in format https://...
ar: أدخل عنوان URL صالحًا بتنسيق // :https
ja: 有効なURLをフォーマット https://... で入力してください。

# validatorRegExp
source: Enter a valid response.
ar: أدخل إجابة صالحة.
ja: 有効な回答を入力してください。

# validatorEntryFormat
source: Enter in format {entryFormat}.
ar: أدخل بتنسيق {entryFormat}.
ja: フォーマット{entryFormat}で入力してください。

# validatorNan
source: Enter a valid number.
ar: أدخل رقمًا صالحًا.
ja: 有効な数字を入力してください。

# validatorMinValue
source: Enter a number of {minValue} or higher.
ar: أدخل رقم {minValue} أو أعلى.
ja: {minValue}以上の数値を入力してください。

# validatorMaxValue
source: Enter a number up to {maxValue}.
ar: أدخل رقمًا يصل إلى {maxValue}.
ja: {maxValue}までの数値を入力してください。

# narrativePageTitle
source: Narrative
ar: رواية
ja: ナラティブ

# questionnaireGenericTitle
source: Survey
ar: استطلاع
ja: 調査

# questionnaireUnknownTitle
source: Untitled
ar: بدون عنوان
ja: 無題

# questionnaireUnknownPublisher
source: Unknown publisher
ar: ناشر غير معروف
ja: 出版社不明

# validatorDate
source: Enter a valid date.
ar: أدخل تاريخًا صالحًا.
ja: 有効な日付を入力してください。

# validatorTime
source: Enter a valid time.
ar: أدخل وقتًا صالحًا.
ja: 有効な時間を入力してください。

# validatorDateTime
source: Enter a valid date and time.
ar: أدخل تاريخًا ووقتًا صالحين.
ja: 有効な日付と時刻を入力してください。

# validatorMinOccurs
source: {minOccurs, plural, =1 {Select at least one option.} other {Select {minOccurs} or more options.}}
ja: {minOccurs, plural, =1 {少なくとも1つの選択肢を選ぶ} other {{minOccurs}以上の選択肢を選ぶ}}。

# validatorMaxOccurs
source: {maxOccurs, plural, =1 {Select up to one option.} other {Select up to {maxOccurs} options.}}
ja: {maxOccurs, plural, =1 {選択肢を1つまで選ぶ} other {{maxOccurs}選択肢を1つまで選ぶ}}。

# dataAbsentReasonAskedDeclinedInputLabel
source: I choose not to answer.
ar: اخترت عدم الرد.
ja: 私は答えないことにしている。

# dataAbsentReasonAskedDeclinedOutput
source: Declined to answer
ar: رفض الإجابة
ja: 回答を拒否した

# dataAbsentReasonAsTextOutput
source: [AS TEXT]
ar: [نص حر]
ja: [フリーテキスト]

# autoCompleteSearchTermInput
source: Enter search term…
ar: أدخل مصطلح البحث…
ja: 検索語を入力...

# responseStatusToCompleteButtonLabel
source: Complete
ar: اكتمال
ja: 完成

# responseStatusToInProgressButtonLabel
source: Amend
ar: يعدل
ja: 修正

# progressQuestionnaireLoading
source: The survey is loading…
ar: يتم تحميل الاستطلاع…
ja: アンケートの読み込み中...

# handlingSaveButtonLabel
source: Save
ja: 保存

# handlingUploadButtonLabel
source: Upload
ja: アップロード

# handlingUploading
source: Uploading survey…
ja: アンケートのアップロード...

# loginStatusLoggingIn
source: Signing in…
ja: サインインすると...

# loginStatusLoggedIn
source: Signed in…
ja: サインは...

# loginStatusLoggingOut
source: Signing out…
ja: サインアウト...

# loginStatusLoggedOut
source: Signed out…
ja: サインアウト...

# loginStatusUnknown
source: Not sure what's going on?
ja: 何が起こっているのかわからない？

# loginStatusError
source: Something went wrong.
ja: 何かが間違っていた。
